/*
С клавиатуры вводится информация о студентах: фамилия, имя, оценки.

Выведите на экран информацию о трех лучших студентах по максимальному баллу.
В случае, если у нескольких студентов средний балл совпадает,
то выведите большее число студентов (пока не будут выведены все студенты или
не будут полностью исчерпаны студенты с тремя лучшими баллами).

Вывод надо осуществлять в порядке убывания максимального балла, а для одинаковых
максимальных баллов - в алфавитном порядке по фамилии и имени.

оценок может быть сколько угодно
*/
fun main() {

}
